espressif/arduino-esp32/libraries/I2S/src/I2S.cpp
  if(!_createCallbackTask()){
    log_e("(I2S#%d) ERROR: failed to create callback task", _deviceIndex);
    end();
    if(!_give_mux()){ return 0; /* ERR */ }
    return 0; // ERR
  }
  _initialized = true;
  if(!_give_mux()){ return 0; /* ERR */ }
  return 1; // OK
}

int I2SClass::_applyPinSetting(){
  if(_driverInstalled){
    esp_i2s::i2s_pin_config_t pin_config = {
      .mck_io_num = I2S_PIN_NO_CHANGE,
      .bck_io_num = _sckPin,
      .ws_io_num = _fsPin,
      .data_out_num = I2S_PIN_NO_CHANGE,
      .data_in_num = I2S_PIN_NO_CHANGE
    };
    if (_state == I2S_STATE_DUPLEX){ // duplex
      pin_config.data_out_num = _outSdPin;
      pin_config.data_in_num = _inSdPin;
    }else{ // simplex
      if(_state == I2S_STATE_RECEIVER){
        pin_config.data_out_num = I2S_PIN_NO_CHANGE;
        pin_config.data_in_num = _sdPin;
      }else if(_state == I2S_STATE_TRANSMITTER){
        pin_config.data_out_num = _sdPin;
        pin_config.data_in_num = I2S_PIN_NO_CHANGE;
      }else{
        pin_config.data_out_num = I2S_PIN_NO_CHANGE;
        pin_config.data_in_num = _sdPin;
      }
    }
    if(ESP_OK != esp_i2s::i2s_set_pin((esp_i2s::i2s_port_t) _deviceIndex, &pin_config)){
      log_e("(I2S#%d) i2s_set_pin failed; attempted settings: SCK=%d; FS=%d; DIN=%d; DOUT=%d", _deviceIndex, pin_config.bck_io_num, pin_config.ws_io_num, pin_config.data_in_num, pin_config.data_out_num);
      return 0; // ERR
    }else{
      return 1; // OK
    }
  } // if(_driverInstalled)
  return 1; // OK
}

void I2SClass::_setSckPin(int sckPin){
  if(!_take_mux()){ return; /* ERR */ }
  if(sckPin >= 0){
    _sckPin = sckPin;
  }else{
    _sckPin = PIN_I2S_SCK;
  }
  if(!_give_mux()){ return; /* ERR */ }
}

int I2SClass::setSckPin(int sckPin){
  if(!_take_mux()){ return 0; /* ERR */ }
  _setSckPin(sckPin);
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

void I2SClass::_setFsPin(int fsPin){
  if(!_take_mux()){ return; /* ERR */ }
  if(fsPin >= 0){
    _fsPin = fsPin;
  }else{
    _fsPin = PIN_I2S_FS;
  }
  if(!_give_mux()){ return; /* ERR */ }
}

int I2SClass::setFsPin(int fsPin){
  if(!_take_mux()){ return 0; /* ERR */ }
  _setFsPin(fsPin);
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

// shared data pin for simplex
void I2SClass::_setDataPin(int sdPin){
  if(!_take_mux()){ return; /* ERR */ }
  if(sdPin >= 0){
    _sdPin = sdPin;
  }else{
    _sdPin = PIN_I2S_SD;
  }
  if(!_give_mux()){ return; /* ERR */ }
}

// shared data pin for simplex
int I2SClass::setDataPin(int sdPin){
  if(!_take_mux()){ return 0; /* ERR */ }
  _setDataPin(sdPin);
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

void I2SClass::_setDataInPin(int inSdPin){
  if(!_take_mux()){ return; /* ERR */ }
  if(inSdPin >= 0){
    _inSdPin = inSdPin;
  }else{
    _inSdPin = PIN_I2S_SD_IN;
  }
  if(!_give_mux()){ return; /* ERR */ }
}

int I2SClass::setDataInPin(int inSdPin){
  if(!_take_mux()){ return 0; /* ERR */ }
  _setDataInPin(inSdPin);
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

void I2SClass::_setDataOutPin(int outSdPin){
  if(!_take_mux()){ return; /* ERR */ }
  if(outSdPin >= 0){
    _outSdPin = outSdPin;
  }else{
    _outSdPin = PIN_I2S_SD;
  }
  if(!_give_mux()){ return; /* ERR */ }
}

int I2SClass::setDataOutPin(int outSdPin){
  if(!_take_mux()){ return 0; /* ERR */ }
  _setDataOutPin(outSdPin);
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::setAllPins(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = setAllPins(PIN_I2S_SCK, PIN_I2S_FS, PIN_I2S_SD, PIN_I2S_SD_OUT, PIN_I2S_SD_IN);
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::setAllPins(int sckPin, int fsPin, int sdPin, int outSdPin, int inSdPin){
  if(!_take_mux()){ return 0; /* ERR */ }
  _setSckPin(sckPin);
  _setFsPin(fsPin);
  _setDataPin(sdPin);
  _setDataOutPin(outSdPin);
  _setDataInPin(inSdPin);
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::setDuplex(){
  if(!_take_mux()){ return 0; /* ERR */ }
  _state = I2S_STATE_DUPLEX;
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::setSimplex(){
  if(!_take_mux()){ return 0; /* ERR */ }
  _state = I2S_STATE_IDLE;
  int ret = _applyPinSetting();
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::isDuplex(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = (int)(_state == I2S_STATE_DUPLEX);
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getSckPin(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _sckPin;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getFsPin(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _fsPin;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getDataPin(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _sdPin;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getDataInPin(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _inSdPin;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getDataOutPin(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _outSdPin;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

void I2SClass::_uninstallDriver(){
  if(_driverInstalled){
    #if (SOC_I2S_SUPPORTS_ADC && SOC_I2S_SUPPORTS_DAC)
      if(_mode == ADC_DAC_MODE){
        esp_i2s::i2s_adc_disable((esp_i2s::i2s_port_t) _deviceIndex);
      }
    #endif
    esp_i2s::i2s_driver_uninstall((esp_i2s::i2s_port_t) _deviceIndex);

    if(_state != I2S_STATE_DUPLEX){
      _state = I2S_STATE_IDLE;
    }
    _driverInstalled = false;
  } // if(_driverInstalled)
}

void I2SClass::end(){
  if(!_take_mux()){ return; /* ERR */ }
  if(xTaskGetCurrentTaskHandle() != _callbackTaskHandle){
    if(_callbackTaskHandle){
      vTaskDelete(_callbackTaskHandle);
      _callbackTaskHandle = NULL; // prevent secondary termination to non-existing task
    }
    _uninstallDriver();
    _onTransmit = NULL;
    _onReceive  = NULL;
    if(_input_ring_buffer != NULL){
      vRingbufferDelete(_input_ring_buffer);
      _input_ring_buffer = NULL;
    }
    if(_output_ring_buffer != NULL){
      vRingbufferDelete(_output_ring_buffer);
      _output_ring_buffer = NULL;
    }
    _initialized = false;
  }else{
    log_w("(I2S#%d) WARNING: ending I2SClass from callback task not permitted, but attempted!", _deviceIndex);
  }
  if(!_give_mux()){ return; /* ERR */ }
}

// Bytes available to read
int I2SClass::available(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = 0;
  if(_input_ring_buffer != NULL){
    ret = _buffer_byte_size - (int)xRingbufferGetCurFreeSize(_input_ring_buffer);
  }
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

