espressif/arduino-esp32/libraries/I2S/src/I2S.cpp
union i2s_sample_t {
  uint8_t b8;
  int16_t b16;
  int32_t b32;
};

int I2SClass::read(){
  if(!_take_mux()){ return 0; /* ERR */ }
  i2s_sample_t sample;
  sample.b32 = 0;
  if(_initialized){
    read(&sample, _bitsPerSample / 8);

    if (_bitsPerSample == 32) {
      if(!_give_mux()){ return 0; /* ERR */ }
      return sample.b32;
    } else if (_bitsPerSample == 24) {
      if(!_give_mux()){ return 0; /* ERR */ }
      return sample.b32;
    } else if (_bitsPerSample == 16) {
      if(!_give_mux()){ return 0; /* ERR */ }
      return sample.b16;
    } else if (_bitsPerSample == 8) {
      if(!_give_mux()){ return 0; /* ERR */ }
      return sample.b8;
    } else {
      if(!_give_mux()){ return 0; /* ERR */ }
      return 0; // sample value
    }
  } // if(_initialized)
  if(!_give_mux()){ return 0; /* ERR */ }
  return 0; // sample value
}

int I2SClass::read(void* buffer, size_t size){
  if(!_take_mux()){ return 0; /* ERR */ }
  size_t requested_size = size;
  if(_initialized){
    if(!_enableReceiver()){
      if(!_give_mux()){ return 0; /* ERR */ }
      return 0; // There was an error switching to receiver
    } // _enableReceiver succeeded ?

    size_t item_size = 0;
    void *tmp_buffer;
    if(_input_ring_buffer != NULL){
      if(_peek_buff_valid){
        memcpy(buffer, &_peek_buff, _bitsPerSample/8);
        _peek_buff_valid = false;
        requested_size -= _bitsPerSample/8;
      }
      tmp_buffer = xRingbufferReceiveUpTo(_input_ring_buffer, &item_size, pdMS_TO_TICKS(1000), requested_size);
      if(tmp_buffer != NULL){
        memcpy(buffer, tmp_buffer, item_size);
        #if (SOC_I2S_SUPPORTS_ADC && SOC_I2S_SUPPORTS_DAC)
          if(_mode == ADC_DAC_MODE){
            for(size_t i = 0; i < item_size / 2; ++i){
              ((uint16_t*)buffer)[i] = ((uint16_t*)buffer)[i] & 0x0FFF;
            }
          } // ADC/DAC mode
        #endif
        vRingbufferReturnItem(_input_ring_buffer, tmp_buffer);
        if(!_give_mux()){ return 0; /* ERR */ }
        return item_size;
      }else{
        log_w("(I2S#%d) input buffer is empty - timed out", _deviceIndex);
        if(!_give_mux()){ return 0; /* ERR */ }
        return 0; // 0 Bytes read / ERR
      } // tmp buffer not NULL ?
    } // ring buffer not NULL ?
  } // if(_initialized)
  if(!_give_mux()){ return 0; /* ERR */ }
  return 0; // 0 Bytes read / ERR
}

size_t I2SClass::write(uint8_t data){
  if(!_take_mux()){ return 0; /* ERR */ }
  size_t ret = 0;
  if(_initialized){
    ret = write_blocking((int32_t*)&data, 1);
  }
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

size_t I2SClass::write(int32_t sample){
  if(!_take_mux()){ return 0; /* ERR */ }
  size_t ret = 0;
  if(_initialized){
    ret = write_blocking(&sample, _bitsPerSample/8);
  }
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

size_t I2SClass::write(const uint8_t *buffer, size_t size){
  if(!_take_mux()){ return 0; /* ERR */ }
  size_t ret = 0;
  if(_initialized){
    ret = write((const void*)buffer, size);
  }
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

size_t I2SClass::write(const void *buffer, size_t size){
  if(!_take_mux()){ return 0; /* ERR */ }
  size_t ret = 0;
  if(_initialized){
    //size_t ret = write_blocking(buffer, size);
    ret = write_nonblocking(buffer, size);
  } // if(_initialized)
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

// blocking version of write
// This version of write will wait indefinitely to write requested samples
// into output buffer
size_t I2SClass::write_blocking(const void *buffer, size_t size){
  if(!_take_mux()){ return 0; /* ERR */ }
  if(_initialized){
    if(!_enableTransmitter()){
      if(!_give_mux()){ return 0; /* ERR */ }
      return 0; // There was an error switching to transmitter
    } // _enableTransmitter succeeded ?

    if(_output_ring_buffer != NULL){
      int ret = xRingbufferSend(_output_ring_buffer, buffer, size, portMAX_DELAY);
      if(pdTRUE == ret){
        if(!_give_mux()){ return 0; /* ERR */ }
        return size;
      }else{
        log_e("(I2S#%d) xRingbufferSend() with infinite wait returned with error", _deviceIndex);
        if(!_give_mux()){ return 0; /* ERR */ }
        return 0;
      } // ring buffer send ok ?
    } // ring buffer not NULL ?
  } // if(_initialized)
  return 0;
  log_w("(I2S#%d) I2S not initialized", _deviceIndex);
  if(!_give_mux()){ return 0; /* ERR */ }
  return 0;
}

// non-blocking version of write
// In case there is not enough space in buffer to write requested size
// this function will try to flush the buffer and write requested data with 0 time-out
// The function will return number of successfully written bytes. It is users responsibility
// to take care of the remaining data.
size_t I2SClass::write_nonblocking(const void *buffer, size_t size){
  if(!_take_mux()){ return 0; /* ERR */ }
  if(_initialized){
    if(_state != I2S_STATE_TRANSMITTER && _state != I2S_STATE_DUPLEX){
      if(!_enableTransmitter()){
        if(!_give_mux()){ return 0; /* ERR */ }
        return 0; // There was an error switching to transmitter
      }
    }
    if(availableForWrite() < size){
      flush();
    }
    if(_output_ring_buffer != NULL){
      if(pdTRUE == xRingbufferSend(_output_ring_buffer, buffer, size, 0)){
        if(!_give_mux()){ return 0; /* ERR */ }
        return size;
      }else{
        log_w("(I2S#%d) I2S could not write all data into ring buffer!", _deviceIndex);
        if(!_give_mux()){ return 0; /* ERR */ }
        return 0;
      }
    }
  } // if(_initialized)
  return 0;
  if(!_give_mux()){ return 0; /* ERR */ } // this should not be needed
}

/*
  Read 1 sample from internal buffer and return it.
  Repeated peeks will return the same sample until read is called.
*/
int I2SClass::peek(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = 0;
  if(_initialized && _input_ring_buffer != NULL && !_peek_buff_valid){
    size_t item_size = 0;
    void *item = NULL;

    item = xRingbufferReceiveUpTo(_input_ring_buffer, &item_size, 0, _bitsPerSample/8); // fetch 1 sample
    if (item != NULL && item_size == _bitsPerSample/8){
      _peek_buff = *((int*)item);
      vRingbufferReturnItem(_input_ring_buffer, item);
      _peek_buff_valid = true;
    }

