espressif/arduino-esp32/libraries/I2S/src/I2S.cpp
  } // if(_initialized)
  if(_peek_buff_valid){
    ret = _peek_buff;
  }
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}
// Requests data from ring buffer and writes data to I2S module
// note: it is NOT necessary to call the flush after writes. Buffer is flushed automatically after receiveing enough data.
void I2SClass::flush(){
  if(!_take_mux()){ return; /* ERR */ }
  if(_initialized){
    const size_t single_dma_buf_byte_size = _i2s_dma_buffer_frame_size*(_bitsPerSample/8)*2;
    size_t item_size = 0;
    void *item = NULL;
    if(_output_ring_buffer != NULL){
      // TODO while available data to fill entire DMA buff - keep flushing
      item = xRingbufferReceiveUpTo(_output_ring_buffer, &item_size, 0, single_dma_buf_byte_size);
      if (item != NULL){
        _fix_and_write(item, item_size);
        vRingbufferReturnItem(_output_ring_buffer, item);
      }
    }
  } // if(_initialized)
  if(!_give_mux()){ return; /* ERR */ }
}

// Bytes available to write
int I2SClass::availableForWrite(){
  int ret = 0;
  if(!_take_mux()){ return 0; /* ERR */ }
  if(_initialized){
    if(_output_ring_buffer != NULL){
      ret = (int)xRingbufferGetCurFreeSize(_output_ring_buffer);
    }
  } // if(_initialized)
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::availableSamplesForWrite(){
  int ret = 0;
  if(!_take_mux()){ return 0; /* ERR */ }
    ret =  availableForWrite() / (_bitsPerSample/8);
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

void I2SClass::onTransmit(void(*function)(void)){
  if(!_take_mux()){ return; /* ERR */ }
  _onTransmit = function;
  if(!_give_mux()){ return; /* ERR */ }
}

void I2SClass::onReceive(void(*function)(void)){
  if(!_take_mux()){ return; /* ERR */ }
  _onReceive = function;
  if(!_give_mux()){ return; /* ERR */ }
}


// Change buffer size. The unit is in frames.
// Byte value can be calculated as follows:
// ByteSize = (bits_per_sample / 8) * number_of_channels * DMABufferFrameSize
// Calling this function will automatically restart the driver, which could cause audio output gap.
int I2SClass::setDMABufferFrameSize(int DMABufferFrameSize){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = 0;
  if(DMABufferFrameSize >= 8 && DMABufferFrameSize <= 1024){
    _i2s_dma_buffer_frame_size = DMABufferFrameSize;
  }else{
    log_e("(I2S#%d) setDMABufferFrameSize: wrong input! Buffer size must be between 8 and 1024. Requested %d", _deviceIndex, DMABufferFrameSize);
    if(!_give_mux()){ return 0; /* ERR */ }
    return 0; // ERR
  } // check requested buffer size

  if(_initialized){
    _uninstallDriver();
    ret = _installDriver();
    if(!_give_mux()){ return 0; /* ERR */ }
    return ret;
  }else{ // check requested buffer size
    if(!_give_mux()){ return 0; /* ERR */ }
    return 1; // It's ok to change buffer size for uninitialized driver - new size will be used on begin()
  } // if(_initialized)
  if(!_give_mux()){ return 0; /* ERR */ }
  return 0; // ERR
}

int I2SClass::getDMABufferFrameSize(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _i2s_dma_buffer_frame_size;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getDMABufferSampleSize(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _i2s_dma_buffer_frame_size * CHANNEL_NUMBER;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getDMABufferByteSize(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _i2s_dma_buffer_frame_size * CHANNEL_NUMBER * (_bitsPerSample/8);
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getRingBufferSampleSize(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _i2s_dma_buffer_frame_size * CHANNEL_NUMBER * _I2S_DMA_BUFFER_COUNT;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getRingBufferByteSize(){
  if(!_take_mux()){ return 0; /* ERR */ }
  int ret = _i2s_dma_buffer_frame_size * CHANNEL_NUMBER * (_bitsPerSample/8) * _I2S_DMA_BUFFER_COUNT;
  if(!_give_mux()){ return 0; /* ERR */ }
  return ret;
}

int I2SClass::getI2SNum(){
  return _deviceIndex;
}

bool I2SClass::isInitialized(){
  return _initialized;
}

int I2SClass::_enableTransmitter(){
  if(_state != I2S_STATE_DUPLEX && _state != I2S_STATE_TRANSMITTER){
    _state = I2S_STATE_TRANSMITTER;
    return _applyPinSetting();
  }
  return 1; // Ok
}

int I2SClass::_enableReceiver(){
  if(_state != I2S_STATE_DUPLEX && _state != I2S_STATE_RECEIVER){
    _state = I2S_STATE_RECEIVER;
    return _applyPinSetting();
  }
  return 1; // Ok
}

void I2SClass::_tx_done_routine(uint8_t* prev_item){
  static bool prev_item_valid = false;
  const size_t single_dma_buf_byte_size = _i2s_dma_buffer_frame_size*(_bitsPerSample/8)* CHANNEL_NUMBER;
  static size_t item_size = 0;
  static size_t prev_item_size = 0;
  static void *item = NULL;
  static int prev_item_offset = 0;
  static size_t bytes_written = 0;

  if(prev_item_valid){ // use item from previous round
    _fix_and_write(prev_item+prev_item_offset, prev_item_size, &bytes_written);
    if(prev_item_size == bytes_written){
      prev_item_valid = false;
    } // write size check
    prev_item_offset = bytes_written;
    prev_item_size -= bytes_written;
  } // prev_item_valid

  if(_output_ring_buffer != NULL && (_buffer_byte_size - xRingbufferGetCurFreeSize(_output_ring_buffer) >= single_dma_buf_byte_size)){ // fill up the I2S DMA buffer
    bytes_written = 0;
    item_size = 0;
    if(_buffer_byte_size - xRingbufferGetCurFreeSize(_output_ring_buffer) >= _i2s_dma_buffer_frame_size*(_bitsPerSample/8)){ // don't read from almost empty buffer
      item = xRingbufferReceiveUpTo(_output_ring_buffer, &item_size, pdMS_TO_TICKS(0), single_dma_buf_byte_size);
      if (item != NULL){
        _fix_and_write(item, item_size, &bytes_written);
        if(item_size != bytes_written){ // save item that was not written correctly for later
          memcpy(prev_item, (void*)&((uint8_t*)item)[bytes_written], item_size-bytes_written);
          prev_item_size = item_size - bytes_written;
          prev_item_offset = 0;
          prev_item_valid = true;
        } // save item that was not written correctly for later
        vRingbufferReturnItem(_output_ring_buffer, item);
      } // Check received item
    } // don't read from almost empty buffer
  } // fill up the I2S DMA buffer
  if(_onTransmit){
    _onTransmit();
  } // user callback
}

void I2SClass::_rx_done_routine(){
  size_t bytes_read = 0;
  const size_t single_dma_buf_byte_size = _i2s_dma_buffer_frame_size*(_bitsPerSample/8)*CHANNEL_NUMBER;

  if(_input_ring_buffer != NULL){
    uint8_t *_inputBuffer = (uint8_t*)malloc(single_dma_buf_byte_size);
    size_t avail = xRingbufferGetCurFreeSize(_input_ring_buffer);
    if(avail > 0){
      esp_err_t ret = esp_i2s::i2s_read((esp_i2s::i2s_port_t) _deviceIndex, _inputBuffer, avail <= single_dma_buf_byte_size ? avail : single_dma_buf_byte_size, (size_t*) &bytes_read, 0);
      if(ret != ESP_OK){
        log_w("(I2S#%d) i2s_read returned with error %d", _deviceIndex, ret);
      }
      _post_read_data_fix(_inputBuffer, &bytes_read);
    }

    if(bytes_read > 0){ // when read more than 0, then send to ring buffer
      if(pdTRUE != xRingbufferSend(_input_ring_buffer, _inputBuffer, bytes_read, 0)){
        log_w("(I2S#%d) I2S failed to send item from DMA to internal buffer\n", _deviceIndex);
      } // xRingbufferSendComplete
    } // if(bytes_read > 0)
    free(_inputBuffer);
    if (_onReceive && avail < _buffer_byte_size){ // when user callback is registered && and there is some data in ring buffer to read
      _onReceive();
    } // user callback
  }
}

void I2SClass::_onTransferComplete(){
  uint8_t prev_item[_i2s_dma_buffer_frame_size*4];
  esp_i2s::i2s_event_t i2s_event;

